Repository: Blezz-tech/kp11-conspects
Catalog: src/src-omegat.tmx
Source language: en_us
Languages: ru_ru

source: # Introduction
ru_ru: # Введение

source: # Starting Out
ru_ru: # Начиная

source: # Translator's footnotes
ru_ru: # Сноски переводчика

source: # Types and Typeclasses
ru_ru: # Типы и классы типов

source: ## About this tutorial
ru_ru: ## Об этом учебном пособии

source: ## An intro to lists
ru_ru: ## Введение в списки

source: ## Baby's first functions
ru_ru: ## Первые детские функции

source: ## Believe the type
ru_ru: ## Верьте типу

source: ## I'm a list comprehension
ru_ru: ## Я - списковое включение (англ. _list comprehension_) Списковое включение^[Альтернативное название, более понятное программистам "генераторы списков". Но использую по [вики](https://ru.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BA%D0%BE%D0%B2%D0%BE%D0%B5_%D0%B2%D0%BA%D0%BB%D1%8E%D1%87%D0%B5%D0%BD%D0%B8%D0%B5#:~:text=%D0%90%D0%B1%D1%81%D1%82%D1%80%D0%B0%D0%BA%D1%86%D0%B8%D1%8F%20%D1%81%D0%BF%D0%B8%D1%81%D0%BA%D0%BE%D0%B2%20%D0%B8%D0%BB%D0%B8%20%D1%81%D0%BF%D0%B8%D1%81%D0%BA%D0%BE%D0%B2%D0%BE%D0%B5%20%D0%B2%D0%BA%D0%BB%D1%8E%D1%87%D0%B5%D0%BD%D0%B8%D0%B5,%D0%BA%D0%BE%D0%BC%D0%BF%D0%B0%D0%BA%D1%82%D0%BD%D0%BE%D0%B3%D0%BE%20%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D1%8F%20%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%B9%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8%20%D1%81%D0%BF%D0%B8%D1%81%D0%BA%D0%BE%D0%B2.)) ]

source: ## Ready, set, go!
ru_ru: ## На старт, внимание, марш!

source: ## So what's Haskell?
ru_ru: ## Итак, что такое Haskell?

source: ## Texas ranges
ru_ru: ## Техасские диапазоны

source: ## Tuples
ru_ru: ## Кортежи

source: ## What you need to dive in
ru_ru: ## Во что вам нужно погрузиться

source: > **Note** these functions operate only on pairs.
ru_ru: > **Примечание** эти функции работают только с парами.

source: > **Note**: We can use the `let` keyword to define a name right in GHCI.
ru_ru: > **Примечание**: Мы можем использовать ключевое слово `let` для определения имени прямо в GHCI.

source: > **Note:** `[]`, `[[]]` and `[[],[],[]]` are all different things.
ru_ru: > **Примечание:** `[]`, `[[]]` и `[[],[],[]]` это все разные вещи.

source: A basic comprehension for a set that contains the first ten even natural numbers is $$S = \{2\ \cdot\ x\ |\ x \in \mathbb{N},\ x \leqslant 10\}$$.
ru_ru: Базовое списковое включение для набора, содержащего первые десять четных натуральных чисел, составляет^[Я не знаю какая запись более правильная для русской традиции записи. Поэтому оставил как в оригинале] $$S = \{2\ \cdot\ x\ |\ x \in \mathbb{N},\ x \leqslant 10\}$$.

source: A common task is putting two lists together.
ru_ru: Обычная задача - собрать два списка воедино.

source: A cool function that produces a list of pairs: `zip`.
ru_ru: Классная функция, которая выдает список пар: `zip`.

source: A handful of functions that produce infinite lists:
ru_ru: Несколько функций, которые создают бесконечные списки:

source: A list contains several lists of numbers.
ru_ru: Список содержит несколько списков чисел.

source: A list of numbers is a list of numbers.
ru_ru: Список чисел - это список чисел.

source: A list produced by a comprehension that draws from two lists of length 4 will have a length of 16, provided we don't filter them.
ru_ru: Список, созданный с помощью спискового включения, который основывается на двух списках длиной 4, будет иметь длину 16, при условии, что мы их не фильтруем.

source: A little pitfall to watch out for here is negating numbers.
ru_ru: Небольшая ошибка, на которую следует обратить внимание здесь, - это отрицание чисел.

source: A singleton tuple would just be the value it contains and as such would have no benefit to us.
ru_ru: Одноэлементный кортеж был бы просто значением, которое он содержит, и как таковой не принес бы нам никакой пользы.

source: A text editor and a Haskell compiler.
ru_ru: Текстовый редактор и компилятор Haskell.

source: Alright, let's get started!
ru_ru: Хорошо, давайте начнем!

source: Although I bet that even if you don't have any significant programming experience, a smart person such as yourself will be able to follow along and learn Haskell.
ru_ru: Хотя я готов поспорить, что даже если у вас нет сколько-нибудь значительного опыта в программировании, такой умный человек, как вы, сможет последовать примеру и изучить Haskell.

source: Although it's simpler to just use the `replicate` function if you want some number of the same element in a list.
ru_ru: Хотя проще просто использовать функцию `replicate`, если вам нужно некоторое количество одного и того же элемента в списке.

source: An expression is basically a piece of code that returns a value.
ru_ru: Выражение - это, по сути, фрагмент кода, который возвращает значение.

source: And here it sees you just want the first 24 elements and it gladly obliges.
ru_ru: И вот он видит, что вам нужны только первые 24 элемента, и с радостью соглашается.

source: And now, a list!
ru_ru: А теперь список!

source: And secondly because some sequences that aren't arithmetic are ambiguous if given only by a few of their first terms.
ru_ru: А во-вторых, потому что некоторые последовательности, которые не являются арифметическими, неоднозначны, если заданы только несколькими их первыми членами.

source: And shorter programs are easier to maintain than longer ones and have less bugs.
ru_ru: А более короткие программы легче поддерживать, чем более длинные, и в них меньше ошибок.

source: And there's our answer!
ru_ru: И вот наш ответ!

source: Another key difference is that they don't have to be homogenous.
ru_ru: Еще одно ключевое отличие заключается в том, что они не обязательно должны быть однородными.

source: Another thing about the if statement in Haskell is that it is an _expression_.
ru_ru: Еще одна особенность оператора `if` в Haskell заключается в том, что оператор является _выражением_ .

source: As expected, the length of the new list is 9.
ru_ru: Как и ожидалось, длина нового списка равна 9.

source: As expected, you can call your own functions from other functions that you made.
ru_ru: Как и ожидалось, вы можете вызывать свои собственные функции из других созданных вами функций.

source: As seen in this example, tuples can also contain lists.
ru_ru: Как видно из этого примера, кортежи также могут содержать списки.

source: As you can see, lists are denoted by square brackets and the values in the lists are separated by commas.
ru_ru: Как вы можете видеть, списки заключены в квадратные скобки, а значения в списках разделены запятыми.

source: As you can see, we get the desired results.
ru_ru: Как вы можете видеть, мы получаем желаемые результаты.

source: As you can see, we just separate the function name from the parameter with a space.
ru_ru: Как вы можете видеть, мы просто отделяем имя функции от параметра пробелом.

source: As you probably know, `&&` means a boolean _and_, `||` means a boolean _or_.
ru_ru: Как вы, вероятно, знаете, `&&` означает логическое _И_, `||` означает логическое _ИЛИ_ .

source: As you've seen, we call it by sandwiching it between them.
ru_ru: Как вы видели, мы вызываем это, помещая его между ними.

source: At first, this seems kind of limiting but it actually has some very nice consequences: if a function is called twice with the same parameters, it's guaranteed to return the same result.
ru_ru: На первый взгляд это кажется своего рода ограничением, но на самом деле это имеет некоторые очень приятные последствия: если функция вызывается дважды с одними и теми же параметрами, она гарантированно возвращает один и тот же результат.

source: Because Haskell is lazy, it won't try to evaluate the infinite list immediately because it would never finish.
ru_ru: Поскольку Haskell ленив, он не будет пытаться оценить бесконечный список немедленно, потому что он никогда не завершится.

source: Because Haskell is lazy, we can zip finite lists with infinite lists:
ru_ru: Поскольку Haskell ленив, мы можем объединять конечные списки с бесконечными списками:

source: Because `'` is a valid character in functions, we can make a function like this.
ru_ru: Поскольку `'` является допустимым символом в функциях, мы можем создать функцию, подобную этой.

source: Because `+` works on integers as well as on floating-point numbers (anything that can be considered a number, really), our function also works on any number.
ru_ru: Поскольку `+` работает как с целыми числами, так и с числами с плавающей запятой (все, что на самом деле можно считать числом), наша функция также работает с любым числом.

source: Because it uses a lot of high level concepts, Haskell programs are usually shorter than their imperative equivalents.
ru_ru: Поскольку в нем используется много высокоуровневых концепций, программы на Haskell обычно короче своих императивных эквивалентов.

source: Because strings are lists, we can use list functions on them, which is really handy.
ru_ru: Поскольку строки представляют собой списки, мы можем использовать для них функции списка, что действительно удобно.

source: Because the else is mandatory, an if statement will always return something and that's why it's an expression.
ru_ru: Поскольку `else` является обязательным, оператор `if` всегда будет возвращать что-то, и именно поэтому это выражение.

source: Because they are not completely precise (by definition), their use in ranges can yield some pretty funky results.
ru_ru: Поскольку они не являются полностью точными (по определению), их использование в диапазонах может привести к довольно странным результатам.

source: Because we can't change what names (and functions) mean once we've defined them, `conanO'Brien` and the string `"It's a-me, Conan O'Brien!"` can be used interchangeably.
ru_ru: Поскольку мы не можем изменить значение имен (и функций), как только мы их определили, `conanO'Brien` и строка `"It's a-me, Conan O'Brien!"` могут использоваться взаимозаменяемо.

source: Boolean algebra is also pretty straightforward.
ru_ru: Булева алгебра также довольно проста.

source: But a tuple of size two (also called a pair) is its own type, which means that a list can't have a couple of pairs in it and then a triple (a tuple of size three), so let's use that instead.
ru_ru: Но кортеж второго размера (также называемый парой) имеет свой собственный тип, что означает, что в списке не может быть пары пар, а затем тройки (кортеж третьего размера), поэтому давайте используем кортеж вместо списка.

source: But if you try to get the sixth element from a list that only has four elements, you'll get an error so be careful!
ru_ru: Но если вы попытаетесь получить шестой элемент из списка, состоящего всего из четырех элементов, вы получите сообщение об ошибке, так что будьте осторожны!

source: But once you want to see the result, the first `doubleMe` tells the second one it wants the result, now!
ru_ru: Но как только вы захотите увидеть результат, первая "двойная строка" сообщит второй, что она хочет получить результат, сейчас же!

source: But putting something at the end of a list that's fifty million entries long is going to take a while.
ru_ru: Но для того, чтобы поместить что-то в конец списка длиной в пятьдесят миллионов записей, потребуется некоторое время.

source: But the catch is that they both have to be the same type of thing.
ru_ru: Но загвоздка в том, что они оба должны быть одного типа.

source: But then once it just "clicked" and after getting over that initial hurdle, it was pretty much smooth sailing.
ru_ru: Но затем, как только это просто "щелкнуло" и после преодоления этого первоначального препятствия, все прошло довольно гладко.

source: But there's a better way: `take 24 [13,26..]`.
ru_ru: Но есть способ получше: `возьми 24 [13,26..]`.

source: But what happens if we try to get the head of an empty list?
ru_ru: Но что произойдет, если мы попытаемся получить начало пустого списка?

source: But what if we didn't want doubles of the first 10 natural numbers but some kind of more complex function applied on them?
ru_ru: Но что, если бы мы хотели получить не удвоения первых 10 натуральных чисел, а какую-то более сложную функцию, примененную к ним?

source: But when defining functions, there's a `=` and after that we define what the function does.
ru_ru: Но при определении функций есть `=`, и после этого мы определяем, что делает функция.

source: But when we call it like that, there may be some confusion as to which number is doing the division and which one is being divided.
ru_ru: Но когда мы называем это таким образом, может возникнуть некоторая путаница относительно того, какое число выполняет деление, а какое делится.

source: By going through several resources, I was able put together the pieces and it all just came falling into place.
ru_ru: Просмотрев несколько ресурсов, я смог собрать воедино кусочки, и все просто встало на свои места.

source: Calling a function with several parameters is also simple.
ru_ru: Вызов функции с несколькими параметрами также прост.

source: Characters can also be enumerated.
ru_ru: Символы также могут быть пронумерованы.

source: Congratulations, you're in GHCI!
ru_ru: Поздравляю, вы находитесь в GHCI!

source: Cool, it works.
ru_ru: Круто, это работает.

source: Doing `5 * -3` will make GHCI yell at you but doing `5 * (-3)` will work just fine.
ru_ru: Выполнение `5 * -3` заставит GHCI кричать на вас, но выполнение `5 * (-3)` будет работать просто отлично.

source: Doing `div 92 10` results in a 9.
ru_ru: Выполнение `div 92 10` приводит к получению 9.

source: Doing `let a = 1` inside GHCI is the equivalent of writing `a = 1` in a script and then loading it.
ru_ru: Выполнение `let a = 1` внутри GHCI эквивалентно записи `a = 1` в скрипте и последующей его загрузке.

source: Easy.
ru_ru: Легко.

source: Even if it wasn't `"llama"` but `"four"` or `"4"`, Haskell still wouldn't consider it to be a number.
ru_ru: Даже если бы это была не `"llama", а "four" или "4", Haskell все равно не счел бы это числом.

source: Even if you're adding an element to the end of a list with `++`, you have to surround it with square brackets so it becomes a list.
ru_ru: Даже если вы добавляете элемент в конец списка с помощью `++`, вы должны заключить его в квадратные скобки, чтобы он стал списком.

source: First the heads are compared.
ru_ru: Сначала сравниваются головы.

source: First, let's try generating all triangles with sides equal to or smaller than 10:
ru_ru: Сначала давайте попробуем сгенерировать все треугольники со сторонами, равными или меньшими 10:

source: Firstly because you can only specify one step.
ru_ru: Во-первых, потому, что вы можете указать только один шаг.

source: For a start, we'll try calling one of the most boring functions in Haskell.
ru_ru: Для начала мы попробуем вызвать одну из самых скучных функций в Haskell.

source: For convenience, we'll put that comprehension inside a function so we can easily reuse it.
ru_ru: Для удобства мы поместим это списковое включение внутрь функции, чтобы мы могли легко использовать его повторно.

source: For example, in C, you use parentheses to call functions like `foo()`, `bar(1)` or `baz(3, "haha")`.
ru_ru: Например, в `C` вы используете круглые скобки для вызова таких функций, как `foo()`, `bar(1)` или `baz(3, "ха-ха")`.

source: For instance, `*` is a function that takes two numbers and multiplies them.
ru_ru: Например, `*` - это функция, которая принимает два числа и умножает их.

source: For instance, if we wanted to represent someone's name and age in Haskell, we could use a triple: `("Christopher", "Walken", 55)`.
ru_ru: Например, если бы мы хотели представить чье-то имя и возраст в Haskell, мы могли бы использовать тройку: `("Christopher", "Walken", 55)`.

source: For instance, the `div` function takes two integers and does integral division between them.
ru_ru: Например, функция `div` принимает два целых числа и выполняет целочисленное деление между ними.

source: For instance, you set variable `a` to 5 and then do some stuff and then set it to something else.
ru_ru: Например, вы устанавливаете переменной `a` значение 5, а затем делаете что-то еще, а затем устанавливаете ее значение на что-то другое.

source: For learning it's a lot easier and faster than compiling every time you make a change and then running the program from the prompt.
ru_ru: Для обучения это намного проще и быстрее, чем компилировать каждый раз, когда вы вносите изменения, а затем запускать программу из командной строки.

source: For now, let's examine how you would get the first 24 multiples of 13.
ru_ru: А пока давайте рассмотрим, как бы вы получили первые 24 числа, кратные 13.

source: For the purposes of this tutorial we'll be using GHC, the most widely used Haskell compiler.
ru_ru: Для целей этого руководства мы будем использовать GHC, наиболее широко используемый компилятор Haskell.

source: Function application (calling a function by putting a space after it and then typing out the parameters) has the highest precedence of them all.
ru_ru: Функциональное приложение (вызывающее функцию, ставя после нее пробел, а затем вводя параметры) имеет самый высокий приоритет из всех.

source: Functions are defined in a similar way that they are called.
ru_ru: Функции определяются аналогично тому, как они вызываются.

source: Functions are usually prefix so from now on we won't explicitly state that a function is of the prefix form, we'll just assume it.
ru_ru: Функции обычно являются префиксными, поэтому с этого момента мы не будем явно указывать, что функция имеет префиксную форму, мы просто предположим это.

source: Functions in Haskell don't have to be in any particular order, so it doesn't matter if you define `doubleMe` first and then `doubleUs` or if you do it the other way around.
ru_ru: Функции в Haskell не обязательно должны располагаться в каком-либо определенном порядке, поэтому не имеет значения, определяете ли вы сначала `doubleMe`, а затем `doubleUs` или делаете это наоборот.

source: GHC can take a Haskell script (they usually have a .hs extension) and compile it but it also has an interactive mode which allows you to interactively interact with scripts.
ru_ru: GHC может взять скрипт на Haskell (обычно они имеют расширение .hs) и скомпилировать его, но он также имеет интерактивный режим, который позволяет вам интерактивно взаимодействовать со скриптами.

source: Had we omitted the parentheses, it would have added one only if `x` wasn't greater than 100.
ru_ru: Если бы мы опустили круглые скобки, это добавило бы единицу только в том случае, если `x` было не больше 100.

source: Haskell is **elegant and concise**.
ru_ru: Haskell **элегантен и лаконичен**.

source: Haskell is **lazy**.
ru_ru: Haskell **ленив**.

source: Haskell is **statically typed**.
ru_ru: Haskell является **статически типизированным**.

source: Haskell is a **purely functional programming language**.
ru_ru: Haskell - это **чисто функциональный язык программирования**.

source: Haskell uses a very good type system that has **type inference**.
ru_ru: Haskell использует очень хорошую систему типов, которая имеет **вывод типа**.

source: Haskell was made by some **really smart guys** (with PhDs).
ru_ru: Haskell был создан несколькими **действительно умными парнями** (с докторскими степенями).

source: Here are some basic functions that operate on lists.
ru_ru: Вот некоторые основные функции, которые работают со списками.

source: Here's a demonstration.
ru_ru: Вот демонстрация.

source: Here's a function that takes a string and removes everything except uppercase letters from it.
ru_ru: Вот функция, которая принимает строку и удаляет из нее все, кроме прописных букв.

source: Here's a problem that combines tuples and list comprehensions: which right triangle that has integers for all sides and all sides equal to or smaller than 10 has a perimeter of 24?
ru_ru: Вот задача, которая сочетает в себе понимание кортежей и списков: какой прямоугольный треугольник, который имеет целые числа для всех сторон и все стороны которого равны или меньше 10, имеет периметр 24?

source: Here's some simple arithmetic.
ru_ru: Вот несколько простых арифметических действий.

source: Here's that comprehension in action.
ru_ru: Вот списковое включение в действии.

source: How about a list comprehension that combines a list of adjectives and a list of nouns … for epic hilarity.
ru_ru: Как насчет спискового включения, которое сочетает в себе список прилагательных и список существительных ... для эпического веселья.

source: How about if we wanted all numbers from 50 to 100 whose remainder when divided with the number 7 is 3?
ru_ru: Как насчет того, если бы мы хотели получить все числа от 50 до 100, остаток от которых при делении на число 7 равен 3?

source: However, if we wanted to get the successor of the product of numbers 9 and 10, we couldn't write `succ 9 * 10` because that would get the successor of 9, which would then be multiplied by 10.
ru_ru: Однако, если бы мы хотели получить преемника произведения чисел 9 и 10, мы не могли бы написать `succ 9 * 10`, потому что это дало бы преемника 9, который затем был бы умножен на 10.

source: However, putting something at the beginning of a list using the `:` operator (also called the cons operator) is instantaneous.
ru_ru: Однако поместить что-либо в начало списка с помощью оператора `:` (также называемого оператором `cons`) можно мгновенно.

source: However, there are a few fundamental differences.
ru_ru: Однако есть несколько фундаментальных отличий.

source: I decided to write this because I wanted to solidify my own knowledge of Haskell and because I thought I could help people new to Haskell learn it from my perspective.
ru_ru: Я решил написать это, потому что хотел укрепить свои собственные знания о Haskell и потому что думал, что смогу помочь людям, новичкам в Haskell, изучить его с моей точки зрения.

source: I don't know.
ru_ru: Я не знаю.

source: I failed to learn Haskell approximately 2 times before finally grasping it because it all just seemed too weird to me and I didn't get it.
ru_ru: Мне не удалось выучить Haskell примерно 2 раза, прежде чем я, наконец, понял его, потому что все это казалось мне слишком странным, и я этого не понял.

source: I guess what I'm trying to say is: Haskell is great and if you're interested in programming you should really learn it even if it seems weird at first.
ru_ru: Наверное, я пытаюсь сказать следующее: Haskell великолепен, и если вы интересуетесь программированием, вам действительно следует его изучить, даже если поначалу это кажется странным.

source: I know!
ru_ru: Я знаю!

source: If a function takes two parameters, we can also call it as an infix function by surrounding it with backticks.
ru_ru: Если функция принимает два параметра, мы также можем вызвать ее как инфиксную функцию, окружив ее обратными кавычками (` `` `).

source: If a function you make takes two parameters and adds them together and you don't explicitly state their type, the function will work on any two parameters that act like numbers.
ru_ru: Если созданная вами функция принимает два параметра и складывает их вместе, и вы явно не указываете их тип, функция будет работать с любыми двумя параметрами, которые действуют как числа.

source: If a number isn't odd, we throw it out of our list.
ru_ru: Если число не нечетное, мы исключаем его из нашего списка.

source: If it is, it returns `True`, otherwise it returns `False`.
ru_ru: Если это так, то он возвращает `True`, в противном случае он возвращает `False`.

source: If there's no monster, it doesn't have a head.
ru_ru: Если монстра нет, то у него нет головы.

source: If they are equal then the second elements are compared, etc.
ru_ru: Если они равны, то сравниваются вторые элементы и т.д.
